spec/fixtures/invoices.create.xml

<?xml version="1.0" encoding="UTF-8"?>
<invoice>
  <id>1503698</id>
  <status>draft</status>
  <type>Invoice</type>
  <sequence_number>draft</sequence_number>
  <date>18/06/2013</date>
  <due_date>18/06/2013</due_date>
  <reference></reference>
  <observations>Artigo 16&#186; n&#186; 6 do CIVA. </observations>
  <retention></retention>
  <permalink>http://www.invoicexpress.net/documents/3bca8a616315b1c8da3c26d692b061220f0f6a45</permalink>
  <client>
    <id>501854</id>
    <name>Ruben Fonseca</name>
  </client>
  <currency>Euro</currency>
  <items type="array">
    <item>
      <name>Item 1</name>
      <description></description>
      <unit_price>30.0</unit_price>
      <unit>unit</unit>
      <quantity>1.0</quantity>
      <tax>
        <name></name>
        <value>0.0</value>
      </tax>
      <discount>0.0</discount>
    </item>
  </items>
  <sum>30.0</sum>
  <discount>0.0</discount>
  <before_taxes>30.0</before_taxes>
  <taxes>0.0</taxes>
  <total>30.0</total>
</invoice>
