spec/fixtures/invoices.list.xml

<?xml version="1.0" encoding="UTF-8"?>
<invoices type="array">
  <invoice>
    <id>1501806</id>
    <status>settled</status>
    <archived>false</archived>
    <type>SimplifiedInvoice</type>
    <sequence_number>2/2013</sequence_number>
    <date>16/06/2013</date>
    <due_date>16/06/2013</due_date>
    <reference></reference>
    <observations>wazzaaaap</observations>
    <retention>0.0</retention>
    <permalink>http://www.invoicexpress.net/documents/e91295d8ca5797e0cc28c9c2ebf00a71c250f0fd</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 6</name>
        <description></description>
        <unit_price>120.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>240.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>240.0</total>
      </item>
      <item>
        <name>Item AM</name>
        <description></description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>1.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>50.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>50.0</total>
      </item>
    </items>
    <sum>290.0</sum>
    <discount>0.0</discount>
    <before_taxes>290.0</before_taxes>
    <taxes>0.0</taxes>
    <total>290.0</total>
  </invoice>
  <invoice>
    <id>1463853</id>
    <status>draft</status>
    <archived>false</archived>
    <type>Invoice</type>
    <sequence_number>rascunho</sequence_number>
    <date>08/06/2013</date>
    <due_date>08/06/2013</due_date>
    <reference></reference>
    <observations>Foi criado no site.</observations>
    <retention>5.0</retention>
    <permalink>http://www.invoicexpress.net/documents/85358d54facb97552b3880aed67be0fd6474d0a3</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>555</name>
        <description>Macbook</description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <id>48900</id>
          <name>IVA23</name>
          <value>23.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>100.0</subtotal>
        <tax_amount>23.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>123.0</total>
      </item>
    </items>
    <sum>100.0</sum>
    <discount>0.0</discount>
    <before_taxes>100.0</before_taxes>
    <taxes>23.0</taxes>
    <total>118.0</total>
  </invoice>
  <invoice>
    <id>1423940</id>
    <status>final</status>
    <archived>false</archived>
    <type>CreditNote</type>
    <sequence_number>3/2013</sequence_number>
    <date>01/05/2013</date>
    <due_date>01/06/2013</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 do CIVA. </observations>
    <retention></retention>
    <permalink>http://www.invoicexpress.net/documents/1387ad1b794bbba30f8378fccc73767038b6477d</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>60.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>120.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>120.0</total>
      </item>
      <item>
        <name>Item 2</name>
        <description></description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>1.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>50.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>50.0</total>
      </item>
    </items>
    <sum>170.0</sum>
    <discount>0.0</discount>
    <before_taxes>170.0</before_taxes>
    <taxes>0.0</taxes>
    <total>170.0</total>
  </invoice>
  <invoice>
    <id>1503648</id>
    <status>draft</status>
    <archived>false</archived>
    <type>CreditNote</type>
    <sequence_number>draft</sequence_number>
    <date>01/05/2013</date>
    <due_date>01/06/2013</due_date>
    <reference></reference>
    <observations>Artigo 6&#186; do Decreto&#8208;Lei n&#186; 198/90, de 19 de Junho.  Artigo 16&#186; n&#186; 6 do CIVA. </observations>
    <retention>0.0</retention>
    <permalink>http://www.invoicexpress.net/documents/7a82cbf5dab0dea0291767b70c75d9d293e4f01f</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>60.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>120.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>120.0</total>
      </item>
      <item>
        <name>Item 2</name>
        <description></description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>1.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>50.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>50.0</total>
      </item>
    </items>
    <sum>170.0</sum>
    <discount>0.0</discount>
    <before_taxes>170.0</before_taxes>
    <taxes>0.0</taxes>
    <total>170.0</total>
  </invoice>
  <invoice>
    <id>1425061</id>
    <status>settled</status>
    <archived>false</archived>
    <type>SimplifiedInvoice</type>
    <sequence_number>1/2013</sequence_number>
    <date>01/05/2013</date>
    <due_date>01/05/2013</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 do CIVA. </observations>
    <retention></retention>
    <permalink>http://www.invoicexpress.net/documents/9c21e2aa2fd5a9f999673bc993407a562177fecb</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>60.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>120.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>120.0</total>
      </item>
      <item>
        <name>Item 2</name>
        <description></description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>1.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>50.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>50.0</total>
      </item>
    </items>
    <sum>170.0</sum>
    <discount>0.0</discount>
    <before_taxes>170.0</before_taxes>
    <taxes>0.0</taxes>
    <total>170.0</total>
  </invoice>
  <invoice>
    <id>1423803</id>
    <status>final</status>
    <archived>false</archived>
    <type>CreditNote</type>
    <sequence_number>2/2013</sequence_number>
    <date>01/05/2013</date>
    <due_date>01/06/2013</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 do CIVA. </observations>
    <retention></retention>
    <permalink>http://www.invoicexpress.net/documents/8b499543512ad74ff3d0bb076c74804ba8946725</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>60.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>120.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>120.0</total>
      </item>
      <item>
        <name>Item 2</name>
        <description></description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>1.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>50.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>50.0</total>
      </item>
    </items>
    <sum>170.0</sum>
    <discount>0.0</discount>
    <before_taxes>170.0</before_taxes>
    <taxes>0.0</taxes>
    <total>170.0</total>
  </invoice>
  <invoice>
    <id>1214538</id>
    <status>draft</status>
    <archived>false</archived>
    <type>Invoice</type>
    <sequence_number>rascunho</sequence_number>
    <date>09/04/2013</date>
    <due_date>09/04/2013</due_date>
    <reference></reference>
    <observations>Foi criado no site.</observations>
    <retention>5.0</retention>
    <permalink>http://www.invoicexpress.net/documents/46effab003ec2688c825202e96fd6a1abf628a0f</permalink>
    <client>
      <id>439232</id>
      <name>Pedro Sousa</name>
      <email>psousa@thinkorange.pt</email>
      <address>Rua Luisa de Cam&#245;es 18</address>
      <postal_code>1231-123</postal_code>
      <country>Portugal</country>
      <fiscal_id>210533382</fiscal_id>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>555</name>
        <description>Macbook</description>
        <unit_price>50.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <id>48900</id>
          <name>IVA23</name>
          <value>23.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>100.0</subtotal>
        <tax_amount>23.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>123.0</total>
      </item>
    </items>
    <sum>100.0</sum>
    <discount>0.0</discount>
    <before_taxes>100.0</before_taxes>
    <taxes>23.0</taxes>
    <total>118.0</total>
  </invoice>
  <invoice>
    <id>1042459</id>
    <status>final</status>
    <archived>false</archived>
    <type>Invoice</type>
    <sequence_number>1/2013</sequence_number>
    <date>01/02/2013</date>
    <due_date>01/02/2013</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 al&#237;nea c) do CIVA. </observations>
    <retention></retention>
    <permalink>http://www.invoicexpress.net/documents/142c88ecc6ac1278ab7e5c8958c21a2f6f7c6cdf</permalink>
    <client>
      <id>393116</id>
      <name>Ruben Fonseca</name>
      <email>fonseka@gmail.com</email>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>30.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>60.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>60.0</total>
      </item>
    </items>
    <sum>60.0</sum>
    <discount>0.0</discount>
    <before_taxes>60.0</before_taxes>
    <taxes>0.0</taxes>
    <total>60.0</total>
  </invoice>
  <invoice>
    <id>1042467</id>
    <status>draft</status>
    <archived>false</archived>
    <type>Invoice</type>
    <sequence_number>draft</sequence_number>
    <date>01/02/2013</date>
    <due_date>01/02/2013</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 al&#237;nea c) do CIVA. </observations>
    <retention></retention>
    <permalink>http://www.invoicexpress.net/documents/cba912896f7dbdfbbbad06c43d9dcce6a0c89c31</permalink>
    <client>
      <id>393116</id>
      <name>Mister Ruben Fonseca</name>
      <email>fonseka@gmail.com</email>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>30.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>60.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>60.0</total>
      </item>
    </items>
    <sum>60.0</sum>
    <discount>0.0</discount>
    <before_taxes>60.0</before_taxes>
    <taxes>0.0</taxes>
    <total>60.0</total>
  </invoice>
  <invoice>
    <id>1425008</id>
    <status>draft</status>
    <archived>false</archived>
    <type>Invoice</type>
    <sequence_number>draft</sequence_number>
    <date>01/02/2013</date>
    <due_date>01/02/2013</due_date>
    <reference></reference>
    <observations>Artigo 16&#186; n&#186; 6 do CIVA. </observations>
    <retention></retention>
    <permalink>http://www.invoicexpress.net/documents/54c63772f0c00523f5089817fcce8ceeffcc7a52</permalink>
    <client>
      <id>393116</id>
      <name>Mister Ruben Fonseca</name>
      <email>fonseka@gmail.com</email>
    </client>
    <currency>Euro</currency>
    <items type="array">
      <item>
        <name>Item 1</name>
        <description></description>
        <unit_price>30.0</unit_price>
        <unit>unit</unit>
        <quantity>2.0</quantity>
        <tax>
          <name></name>
          <value>0.0</value>
        </tax>
        <discount>0.0</discount>
        <subtotal>60.0</subtotal>
        <tax_amount>0.0</tax_amount>
        <discount_amount>0.0</discount_amount>
        <total>60.0</total>
      </item>
    </items>
    <sum>60.0</sum>
    <discount>0.0</discount>
    <before_taxes>60.0</before_taxes>
    <taxes>0.0</taxes>
    <total>60.0</total>
  </invoice>
  <current_page>1</current_page>
  <total_pages>2</total_pages>
  <total_entries>15</total_entries>
  <per_page>10</per_page>
</invoices>
